In [1]:
%reload_ext sql

#Connect the notebook with the database
%sql postgresql://user:password@localhost:5432/postgres

In [20]:
%%sql 
SELECT * FROM alumni

 * postgresql://user:***@localhost:5432/postgres
4 rows affected.

[(1, 'Frank', 2020, 'Social Work'),
 (2, 'Grace', 2019, 'Arts'),
 (3, 'Hannah', 2021, 'History'),
 (4, 'Ian', 2020, 'Biology')]

### For these exercises you have to use the students table that was created in the notebook 02 and the alumni table that you run now:

In [ ]:
# %%sql 
# DROP TABLE IF EXISTS alumni;

 * postgresql://user:***@localhost:5432/postgres
Done.

[]

In [29]:
%%sql
CREATE TABLE alumni (
    alumni_id INT PRIMARY KEY,
    name TEXT NOT NULL,
    graduation_year INT,
    major TEXT
);

INSERT INTO alumni (alumni_id, name, graduation_year, major) VALUES
(7, 'Grace', 2019, 'Arts'),
(8, 'Hannah', 2021, 'History'),
(9, 'Ian', 2020, 'Biology'), 
(10, 'Diana', 2023, 'Biology'),
(11, 'Alice', 2022, 'Civil Engineering'),
(12, 'Frank', 2020, 'Social Work');

 * postgresql://user:***@localhost:5432/postgres
Done.
6 rows affected.

[]

### 1. Select all student names from Computer Science and all student names from Economics, using UNION.

In [4]:
%%sql 
SELECT name FROM students 
WHERE major = 'Computer Science'
UNION
SELECT name FROM students
WHERE major = 'Economics';

 * postgresql://user:***@localhost:5432/postgres
3 rows affected.

[('Alice',), ('Bob',), ('Diana',)]

### 2. Select all student ages from the table twice:
- Once with UNION
- Once with UNION ALL

Observe the difference. What happens?

In [5]:
%%sql
SELECT age FROM students
UNION
SELECT age FROM students;

 * postgresql://user:***@localhost:5432/postgres
5 rows affected.

[(22,), (19,), (18,), (21,), (20,)]

In [6]:
%%sql
SELECT age FROM students
UNION ALL
SELECT age FROM students;

 * postgresql://user:***@localhost:5432/postgres
10 rows affected.

[(20,), (22,), (19,), (21,), (18,), (20,), (22,), (19,), (21,), (18,)]

UNION removes duplicates, UNION ALL keeps them

### 3. Select students younger than 20 union students older than 21.

In [7]:
%%sql
SELECT name, age FROM students
WHERE age < 20
UNION
SELECT name, age FROM students
WHERE age > 21;

 * postgresql://user:***@localhost:5432/postgres
3 rows affected.

[('Bob', 22), ('Eve', 18), ('Charlie', 19)]

### 4. Select all majors from students and all majors from alumni with duplicates

In [8]:
%%sql
SELECT major FROM students
UNION ALL
SELECT major FROM alumni;

 * postgresql://user:***@localhost:5432/postgres
9 rows affected.

[('Computer Science',),
 ('Economics',),
 ('Chemistry',),
 ('Computer Science',),
 (None,),
 ('Social Work',),
 ('Arts',),
 ('History',),
 ('Biology',)]

### 5. Select students older than 20 and alumni graduated after 2020

In [9]:
%%sql
SELECT name FROM students
WHERE age > 20
UNION
SELECT name FROM alumni
WHERE graduation_year > 2020;

 * postgresql://user:***@localhost:5432/postgres
3 rows affected.

[('Diana',), ('Hannah',), ('Bob',)]

### 6. Select all student names and UNION with a single row 'Unknown' as name.

In [10]:
%%sql
SELECT name FROM students
UNION
SELECT 'Unknown'::text as name;

 * postgresql://user:***@localhost:5432/postgres
6 rows affected.

[('Diana',), ('Eve',), ('Bob',), ('Unknown',), ('Charlie',), ('Alice',)]

### 7. Select name and major from both tables

In [11]:
%%sql
SELECT name, major FROM students
UNION
SELECT name, major FROM alumni

 * postgresql://user:***@localhost:5432/postgres
9 rows affected.

[('Alice', 'Computer Science'),
 ('Hannah', 'History'),
 ('Frank', 'Social Work'),
 ('Eve', None),
 ('Ian', 'Biology'),
 ('Charlie', 'Chemistry'),
 ('Diana', 'Computer Science'),
 ('Bob', 'Economics'),
 ('Grace', 'Arts')]

### 8. Select major from students and major from alumni using UNION ALL, then count how many total rows each major appears in.

In [12]:
%%sql
SELECT major FROM students
UNION ALL
SELECT major FROM alumni

 * postgresql://user:***@localhost:5432/postgres
9 rows affected.

[('Computer Science',),
 ('Economics',),
 ('Chemistry',),
 ('Computer Science',),
 (None,),
 ('Social Work',),
 ('Arts',),
 ('History',),
 ('Biology',)]

In [13]:
%%sql
SELECT major, COUNT(*) FROM    
    (SELECT major FROM students
    UNION ALL
    SELECT major FROM alumni)
GROUP BY major;

 * postgresql://user:***@localhost:5432/postgres
8 rows affected.

[(None, 1),
 ('Computer Science', 2),
 ('Chemistry', 1),
 ('History', 1),
 ('Arts', 1),
 ('Economics', 1),
 ('Social Work', 1),
 ('Biology', 1)]

### 9. Select the names of all students and alumni, but also include a column that shows whether each row comes from the students table or the alumni table. Combine them using UNION ALL.

In [16]:
%%sql
SELECT name, 'students' as source FROM students
UNION ALL
SELECT name, 'alumni' as source FROM alumni;

 * postgresql://user:***@localhost:5432/postgres
9 rows affected.

[('Alice', 'students'),
 ('Bob', 'students'),
 ('Charlie', 'students'),
 ('Diana', 'students'),
 ('Eve', 'students'),
 ('Frank', 'alumni'),
 ('Grace', 'alumni'),
 ('Hannah', 'alumni'),
 ('Ian', 'alumni')]

### 10. Select the names of students and alumni who are in the Computer Science or Biology majors, and combine them into a single list using UNION.

In [18]:
%%sql
SELECT name FROM students
WHERE major = 'Computer Science'
UNION ALL
SELECT name FROM alumni
WHERE major = 'Biology';

 * postgresql://user:***@localhost:5432/postgres
3 rows affected.

[('Alice',), ('Diana',), ('Ian',)]